Chapters/Chapter_5/CASE2.1_OC4_moorDyn/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hub_h               90;

D                   126;

R                   63;

span                61.5;

chord               3.8;

turb_mass           697460;

turb_comx           -0.2;

turb_comy           0;

turb_comz           64;

BL_thick            0.2;

float_width         74;

plat_mass           13473000;

plat_comx           0;

plat_comz           -13.46;

plat_Ixx            6.827e+09;

plat_Iyy            6.827e+09;

plat_Izz            1.226e+10;

plat_orientation    ( 1 0 0 0 1 0 0 0 1 );

total_mass          14170460;

total_comx          -0.0098438583;

total_comz          -9.6474737;

Ux                  9;

I                   0.02;

TSR                 7.5;

water_depth         200;

wave_period         10;

wave_height         6;

wave_length         156.13;

in_len              156.13;

out_len             312.26;

sim_len             312.26;

CFLmax              0.5;

dtmax               0.025;

dt0                 0.01;

t_final             400;

length              780.65;

air_h               135;

width               312.26;

height              335;

size_0              6.4;

size_x              6.4;

xmin                -312.26;

xmax                468.39;

ymin                -156.13;

ymax                156.13;

zmin                -200;

zmax                135;

l1                  156.13;

l2                  312.26;

l3                  312.26;

w2                  156.13;

w1                  78.065;

w3                  78.065;

h2                  167.5;

h1                  83.75;

h3                  83.75;

seaLevel            0;

relaxationNames     ( inlet outlet );

initializationName  inlet;

inletCoeffs
{
    waveType            stokesFirst;
    Tsoft               0;
    depth               200;
    period              10;
    direction           ( 1 0 0 );
    phi                 0;
    height              6;
    waveNumber          (0.040243043 0 0);
    omega               0.62831853;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( -312.26 0 -200 );
        endX                ( -156.13 0 24 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               0.1;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 156.13 0 -200 );
        endX                ( 468.39 0 24 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
